In [1]:
import pandas as pd
import numpy as np

In [11]:
arr = np.ndarray(shape=[20], dtype=int)
display('Array', arr)
pd.DataFrame(arr, columns=['data'])

'Array'

array([4128860, 6029375, 3801155, 5242972, 7274610, 6619242, 7602275,
       6029427, 6881383, 6226036, 6619252, 7602291, 7340127, 7274610,
       6029418, 6226015, 7209065, 7602281, 6226015, 7340078])

       data
0   4128860
1   6029375
2   3801155
3   5242972
4   7274610
5   6619242
6   7602275
7   6029427
8   6881383
9   6226036
10  6619252
11  7602291
12  7340127
13  7274610
14  6029418
15  6226015
16  7209065
17  7602281
18  6226015
19  7340078